# Data Cleaning: Part 2

## Cleaning Not-Null Values

In [65]:
import pandas as pd
import numpy as np

In [66]:
dataFrame = pd.DataFrame({
    'Gender': ['Male', 'Female', 'Female', 'Female', 'ABC'],
    'Age': [41, 35, 24, 52, 380]},
index= ['John', 'Mary', 'Susan', 'Hannah', 'Robert'])

In [67]:
dataFrame

        Gender  Age
John      Male   41
Mary    Female   35
Susan   Female   24
Hannah  Female   52
Robert     ABC  380

### Identify The Unique Values

In [68]:
dataFrame['Gender'].unique() # Print the unique values of 'Gender' column

array(['Male', 'Female', 'ABC'], dtype=object)

In [69]:
dataFrame['Gender'].value_counts() # Print the counts of unique values

Gender
Female    3
Male      1
ABC       1
Name: count, dtype: int64

In [70]:
dataFrame['Gender'] = dataFrame['Gender'].replace('ABC', 'Male')
 # Replace the mistaken data

In [71]:
dataFrame[dataFrame['Age'] > 60] # Let's say this company doesn't have any employees older than 60.
# Filter the employees for this condition

       Gender  Age
Robert   Male  380

In [74]:
# Let's change this data
dataFrame.loc[dataFrame['Age'] > 60, 'Age'] = 59
# Replace the mistaken data with 59

In [75]:
dataFrame

        Gender  Age
John      Male   41
Mary    Female   35
Susan   Female   24
Hannah  Female   52
Robert    Male   59

## Duplicates

### Duplicates in Series

In [85]:
directors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Celine Sciamma',
    'Ken Loach',
    'Edgar Wright',
    'Luca Guadagnino',
    'Rainer Werner Fassbinder',
    'Werner Herzog',
    'Wim Wenders'
])

In [86]:
directors

Celine Sciamma                      France
Ken Loach                   United Kingdom
Edgar Wright                United Kingdom
Luca Guadagnino                      Italy
Rainer Werner Fassbinder           Germany
Werner Herzog                      Germany
Wim Wenders                        Germany
dtype: object

In [88]:
directors.duplicated()
# Print the duplicated values (those also printed earlier)
# Note: Even if it is duplicated in general, the first value is always non-duplicated.

Celine Sciamma              False
Ken Loach                   False
Edgar Wright                 True
Luca Guadagnino             False
Rainer Werner Fassbinder    False
Werner Herzog                True
Wim Wenders                  True
dtype: bool

In [90]:
directors.duplicated(keep = 'last')
# Change this behaviour by reading the data from last row.
# The last value is no longer copied and the one in the top row is copied instead. .

Celine Sciamma              False
Ken Loach                    True
Edgar Wright                False
Luca Guadagnino             False
Rainer Werner Fassbinder     True
Werner Herzog                True
Wim Wenders                 False
dtype: bool

In [92]:
directors.duplicated(keep = False)
# Remove this behaviour completely and set all the duplicated as 'True'

Celine Sciamma              False
Ken Loach                    True
Edgar Wright                 True
Luca Guadagnino             False
Rainer Werner Fassbinder     True
Werner Herzog                True
Wim Wenders                  True
dtype: bool

### Drop The Duplicates

In [98]:
directors.drop_duplicates()
# Duplicated values are dropped but the first ones are kept

Celine Sciamma                      France
Ken Loach                   United Kingdom
Luca Guadagnino                      Italy
Rainer Werner Fassbinder           Germany
dtype: object

In [99]:
directors.drop_duplicates(keep = 'last')
# Include the last duplicated value too

Celine Sciamma             France
Edgar Wright       United Kingdom
Luca Guadagnino             Italy
Wim Wenders               Germany
dtype: object

In [100]:
directors.drop_duplicates(keep = False)
# No duplicated value is stored this time

Celine Sciamma     France
Luca Guadagnino     Italy
dtype: object

### Duplicates in DataFrame

In [108]:
actors = pd.DataFrame ({
    'Name': [
        'Tom Cruise',
        'Meg Ryan',
        'Nicolas Cage',
        'Jack Nicholson',
        'Jack Nicholson',
    ],
    'Favorite Genre': [
        'Action',
        'Comedy',
        'Drama',
        'Comedy',
        'Drama'
    ]
})

In [109]:
actors

             Name Favorite Genre
0      Tom Cruise         Action
1        Meg Ryan         Comedy
2    Nicolas Cage          Drama
3  Jack Nicholson         Comedy
4  Jack Nicholson          Drama

In [110]:
actors.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [112]:
actors.duplicated(subset=['Name'])
# See if any actor name is duplicated with a subset

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [114]:
actors.drop_duplicates(subset=['Name'])
# Drop these duplicated values

             Name Favorite Genre
0      Tom Cruise         Action
1        Meg Ryan         Comedy
2    Nicolas Cage          Drama
3  Jack Nicholson         Comedy

## Text Handling

In [115]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})

In [116]:
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [118]:
df['Data'].str.split('_')
# Split the compact data with _ inside of it

0       [1987, M, US , 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [120]:
df['Data'].str.split('_', expand=True)
# Expand the result to a proper data frame

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [121]:
df = df['Data'].str.split('_', expand=True)
# Set this form as the default one

In [124]:
df.columns = ['Year', 'Gender', 'Country', 'Children Number']

In [125]:
df

    Year Gender Country Children Number
0   1987      M     US                1
1  1990?      M      UK               1
2   1992      F      US               2
3  1970?      M      IT               1
4   1985      F    I  T               2

In [133]:
df['Year'].str.contains('\\?')
# Select those which contains ? in their Year values

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

In [134]:
df['Country'].str.contains('I')

0    False
1    False
2    False
3     True
4     True
Name: Country, dtype: bool

In [135]:
df['Country'].str.strip()

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

In [139]:
df['Country'].str.replace(' ', '')
# Remove the spaces

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object

In [140]:
df['Year'].str.replace('?', '')
# Remove the unnecesarry ? signs

0    1987
1    1990
2    1992
3    1970
4    1985
Name: Year, dtype: object